from collections import namedtuple


# Функция для определения категории по ключевым словам
def categorize_text(text):

    for id_cat, category in categories.items():
        if any(word in text for word in category.key_words):
            return id_cat

    # Возвращаем категорию "неопределно", если ключевые слова не найдены
    return 0


def name_category(id):
    """Функция возвращает название по числовому id

    Args:
        id (int): id категории

    Returns:
        str: название категории
    """
    return categories[id].name


def determine_priority(text):
    """Функция для определения приоритета текста на основе его эмоциональной окраски

    Args:
        text (str): текст для анализа

    Returns:
        int: id приоритета
    """

    for priority_id, priority in priorities.items():
        if any(keyword in text for keyword in priority.key_words):
            return priority_id

    # Если ключевые слова не найдены, но есть восклицательные знаки,
    # то код 1 - Высокий приоритет
    if "!" in text:
        return 1

    # Если приоритет не найден, то возвращаем код 0 - не определено
    return 0


def name_priority(id):
    """Функция возвращает название приоритета по числовому id

    Args:
        id (int): id приоритета

    Returns:
        str: название приоритета
    """
    return priorities[id].name


# Основная функция скрипта
def process_texts(text):

    category = categorize_text(text)
    priority = determine_priority(text)

    return {"category": category, "priority": priority}


# Категории и приоритеты
Category = namedtuple("Category", "name key_words")
Priority = namedtuple("Priority", "name key_words")

categories = {
    0: Category(
        "Не определено",
        [
            "неизвестно",
            "неопределенный",
            "непонятно",
            "странно",
            "какая-то",
            "какое-то",
            "что-то",
        ],
    ),
    1: Category(
        "Финансовая система",
        [
            "деньги",
            "бюджет",
            "финансы",
            "инвестиции",
            "акции",
            "банк",
            "экономика",
            "доход",
            "расход",
            "баланс",
            "фондовый рынок",
            "налоги",
            "кредит",
            "депозит",
            "валюта",
            "облигации",
            "страхование",
            "рентабельность",
            "ликвидность",
            "финансовый отчет",
        ],
    ),
    2: Category(
        "Сетевая проблема",
        [
            "сеть",
            "интернет",
            "соединение",
            "маршрутизатор",
            "сервер",
            "IP",
            "VPN",
            "протокол",
            "шифрование",
            "порт",
            "Wi-Fi",
            "LAN",
            "WAN",
            "пинг",
            "трафик",
            "брандмауэр",
            "DNS",
            "провайдер",
            "безопасность сети",
            "скорость интернета",
        ],
    ),
    3: Category(
        "Почта",
        [
            "почта",
            "электронная почта",
            "письмо",
            "вложение",
            "спам",
            "рассылка",
            "SMTP",
            "IMAP",
            "почтовый сервер",
            "почтовый клиент",
            "фильтрация",
            "адресат",
            "отправитель",
            "тема письма",
            "подпись",
            "автоответчик",
            "массовая рассылка",
            "письмо-запрос",
            "конфиденциальность",
            "письмо-уведомление",
        ],
    ),
    4: Category(
        "Связь",
        [
            "связь",
            "телефон",
            "мобильный",
            "оператор",
            "сигнал",
            "звонок",
            "SMS",
            "голосовая почта",
            "роуминг",
            "SIM-карта",
            "LTE",
            "4G",
            "5G",
            "сотовая связь",
            "базовая станция",
            "абонент",
            "тариф",
            "минуты",
            "сообщение",
            "передача данных",
        ],
    ),
    5: Category(
        "Техника",
        [
            "техника",
            "компьютер",
            "принтер",
            "сканер",
            "ноутбук",
            "монитор",
            "жесткий диск",
            "USB",
            "мышь",
            "клавиатура",
            "процессор",
            "видеокарта",
            "RAM",
            "оперативная память",
            "SSD",
            "HDD",
            "материнская плата",
            "питание",
            "зарядное устройство",
            "гаджет",
        ],
    ),
    6: Category(
        "Безопасность",
        [
            "безопасность",
            "вирус",
            "антивирус",
            "шпионское ПО",
            "фишинг",
            "хакер",
            "защита данных",
            "шифрование",
            "пароль",
            "доступ",
            "биометрия",
            "отпечаток пальца",
            "лицензия",
            "бэкап",
            "восстановление данных",
            "контроль доступа",
            "аудит",
            "угроза",
            "безопасность приложений",
            "компьютерная безопасность",
        ],
    ),
    7: Category(
        "Операционная система",
        [
            "операционная система",
            "Windows",
            "Linux",
            "macOS",
            "обновление",
            "установка",
            "драйвер",
            "системный файл",
            "реестр",
            "командная строка",
            "терминал",
            "пользовательский интерфейс",
            "GUI",
            "процесс",
            "задача",
            "память",
            "диспетчер задач",
            "настройки системы",
            "безопасный режим",
            "системный журнал",
        ],
    ),
    8: Category(
        "Office",
        [
            "Office",
            "Word",
            "Excel",
            "PowerPoint",
            "Outlook",
            "редактирование",
            "таблица",
            "презентация",
            "документ",
            "шаблон",
            "форматирование",
            "диаграмма",
            "график",
            "макрос",
            "функция",
            "формула",
            "сортировка",
            "фильтрация",
            "почтовый слияние",
            "электронные таблицы",
        ],
    ),
}

priorities = {
    0: Priority("Не определен", []),
    1: Priority(
        "Высокий",
        [
            "срочно",
            "немедленно",
            "важно",
            "критический",
            "неотложный",
        ],
    ),
    2: Priority(
        "Средний",
        [
            "проблема",
            "задержка",
            "необходимо",
            "требуется",
            "ожидается",
        ],
    ),
    3: Priority(
        "Низкий",
        [
            "информация",
            "запрос",
            "пожелание",
            "рекомендация",
            "уведомление",
        ],
    ),
}
