categories = {        
    0: 'Не определено',
    1: 'Финансовая система',
    2: 'Сетевая проблема',
    3: 'Почта',
    4: 'Связь',
    5: 'Техника',
    6: 'Безопасность',
    7: 'Операционная система',
    8: 'Office'
    }

priorities = {
    0: 'Не определен',
    1: 'Высокий',
    2: 'Средний',
    3: 'Низкий'
    }

if __name__ == '__main__':
    # наглядная распечатка переменных
    print("-"*100)
    print("Категории заявок")

    for cat_num, cat in categories.items():
        print(cat_num,"=", cat)
    
    print("-"*100)
    print("Приоритеты заявок")

    # наглядная распечатка переменных
    for prior_num, prior in priorities.items():
        print(prior_num,"=", prior)

